devsites.org
#+title: Developer Sites Participation
#+author: Marco Craveiro
#+options: num:nil author:nil toc:nil
#+bind: org-html-validation-link nil
#+HTML_HEAD: <link rel="stylesheet" href="../css/tufte.css" type="text/css" />

[[file:../index.org][Back to home page]].

* Stackoverflow

** Mine

 List of questions and answers I've done in Stack Overflow.

*** Emacs

- [[https://emacs.stackexchange.com/questions/63391/how-do-i-link-to-an-id-on-a-non-org-mode-file][Q: How do I link to an ID on a non org-mode file?]]
- [[https://emacs.stackexchange.com/questions/45490/changing-display-function-in-define-word-package/63637#63637][A: changing display function in define-word package]]
- [[https://emacs.stackexchange.com/questions/63350/how-can-i-display-very-large-svg-files-using-image-mode/63373#63373][Q: How can I display very large SVG files using `image-mode`?]]
- [[https://stackoverflow.com/questions/1587972/how-to-display-indentation-guides-in-emacs/56144459#56144459][A: How to display indentation guides in Emacs?]]
- Q&A: [[https://emacs.stackexchange.com/questions/63886/large-org-mode-file-causes-error-re-entering-top-level-after-c-stack-overflow][Large org-mode file causes error “Re-entering top level after C stack overflow”]]

*** Dotnet

 - [[https://stackoverflow.com/questions/7557562/how-do-i-get-the-message-msbuild-task-to-show-up-in-the-visual-studio-project/61209137#61209137][Answer: How do I get the <Message> MSBuild task to show up in the Visual Studio project output?]]

*** C++

 - [[https://stackoverflow.com/questions/39798321/generate-clang-compilation-database-for-a-visual-studio-project/55675091#55675091][Answer: Generate clang compilation database for a Visual Studio project]]
 - [[https://stackoverflow.com/questions/6835728/how-to-break-when-a-specific-exception-type-is-thrown-in-gdb/61030819#61030819][Answer: How to break when a specific exception type is thrown in GDB?]]
 - [[https://stackoverflow.com/questions/58205454/faster-execution-of-vanilla-swaps-in-python-in-quantlib/62397407#62397407][Answer: Faster execution of Vanilla Swaps in Python in Quantlib]]
 - [[https://stackoverflow.com/questions/47475731/cmake-include-directories-for-custom-target-type/58200691#58200691][Answer: CMake include_directories for custom target type]]
 - [[https://stackoverflow.com/questions/39910468/odb-c-unknown-database-schema-error/58107350#58107350][Answer: ODB C++ - Unknown database schema error]]

** Others

 Links to questions that I have used in the past for some reason or
 other and I don't want to forget.

*** Emacs

 - [[https://emacs.stackexchange.com/questions/4253/how-to-start-emacs-with-a-custom-user-emacs-directory][How to start emacs with a custom user-emacs-directory]]

* GitHub

Any useful commentary in GitHub.

** Mine

Tickets that I raised, or to which I added significant commentary.

** C++

- [[https://github.com/jothepro/doxygen-awesome-css/issues/2][doxygen-awesome-css: Creating a link to the dark theme]]
- [[https://github.com/doxygen/doxygen/issues/8455][doxygen: Documentation coverage information]]

*** Emacs

- [[https://github.com/skuro/plantuml-mode/issues/134][plantuml-mode: Vertical split preview #134]]
- [[https://github.com/nobiot/org-transclusion/issues/59][org-transclusion: Transclusion of non-org mode files #59]]
- [[https://github.com/abo-abo/define-word/issues/29][define-word: Redefining display function to output to a buffer instead of messages #29]]
- [[https://github.com/emacs-csharp/csharp-mode/issues/230][beginning-of-defun et al. not behaving the same as on C++ mode]]

# Variables:
# org-html-validation-link: nil
# org-tufte-include-footnotes-at-bottom: t
# End:
