devsites.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-03-23 Tue 21:31 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Developer Sites Participation</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" href="../css/tufte.css" type="text/css" />
</head>
<body>
<div id="content">
<h1 class="title">Developer Sites Participation</h1>
<p>
<a href="../index.html">Back to home page</a>.
</p>

<div id="outline-container-orgf04be1d" class="outline-2">
<h2 id="orgf04be1d">Stackoverflow</h2>
<div class="outline-text-2" id="text-orgf04be1d">
</div>
<div id="outline-container-org248d228" class="outline-3">
<h3 id="org248d228">Mine</h3>
<div class="outline-text-3" id="text-org248d228">
<p>
List of questions and answers I've done in Stack Overflow.
</p>
</div>

<div id="outline-container-org95dc52d" class="outline-4">
<h4 id="org95dc52d">Emacs</h4>
<div class="outline-text-4" id="text-org95dc52d">
<ul class="org-ul">
<li><a href="https://emacs.stackexchange.com/questions/63391/how-do-i-link-to-an-id-on-a-non-org-mode-file">Q: How do I link to an ID on a non org-mode file?</a></li>
<li><a href="https://emacs.stackexchange.com/questions/45490/changing-display-function-in-define-word-package/63637#63637">A: changing display function in define-word package</a></li>
<li><a href="https://emacs.stackexchange.com/questions/63350/how-can-i-display-very-large-svg-files-using-image-mode/63373#63373">Q: How can I display very large SVG files using `image-mode`?</a></li>
<li><a href="https://stackoverflow.com/questions/1587972/how-to-display-indentation-guides-in-emacs/56144459#56144459">A: How to display indentation guides in Emacs?</a></li>
<li>Q&amp;A: <a href="https://emacs.stackexchange.com/questions/63886/large-org-mode-file-causes-error-re-entering-top-level-after-c-stack-overflow">Large org-mode file causes error “Re-entering top level after C stack overflow”</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgf353ea6" class="outline-4">
<h4 id="orgf353ea6">Dotnet</h4>
<div class="outline-text-4" id="text-orgf353ea6">
<ul class="org-ul">
<li><a href="https://stackoverflow.com/questions/7557562/how-do-i-get-the-message-msbuild-task-to-show-up-in-the-visual-studio-project/61209137#61209137">Answer: How do I get the &lt;Message&gt; MSBuild task to show up in the Visual Studio project output?</a></li>
</ul>
</div>
</div>

<div id="outline-container-org743457e" class="outline-4">
<h4 id="org743457e">C++</h4>
<div class="outline-text-4" id="text-org743457e">
<ul class="org-ul">
<li><a href="https://stackoverflow.com/questions/39798321/generate-clang-compilation-database-for-a-visual-studio-project/55675091#55675091">Answer: Generate clang compilation database for a Visual Studio project</a></li>
<li><a href="https://stackoverflow.com/questions/6835728/how-to-break-when-a-specific-exception-type-is-thrown-in-gdb/61030819#61030819">Answer: How to break when a specific exception type is thrown in GDB?</a></li>
<li><a href="https://stackoverflow.com/questions/58205454/faster-execution-of-vanilla-swaps-in-python-in-quantlib/62397407#62397407">Answer: Faster execution of Vanilla Swaps in Python in Quantlib</a></li>
<li><a href="https://stackoverflow.com/questions/47475731/cmake-include-directories-for-custom-target-type/58200691#58200691">Answer: CMake include<sub>directories</sub> for custom target type</a></li>
<li><a href="https://stackoverflow.com/questions/39910468/odb-c-unknown-database-schema-error/58107350#58107350">Answer: ODB C++ - Unknown database schema error</a></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org38a6178" class="outline-3">
<h3 id="org38a6178">Others</h3>
<div class="outline-text-3" id="text-org38a6178">
<p>
Links to questions that I have used in the past for some reason or
other and I don't want to forget.
</p>
</div>

<div id="outline-container-org53d467f" class="outline-4">
<h4 id="org53d467f">Emacs</h4>
<div class="outline-text-4" id="text-org53d467f">
<ul class="org-ul">
<li><a href="https://emacs.stackexchange.com/questions/4253/how-to-start-emacs-with-a-custom-user-emacs-directory">How to start emacs with a custom user-emacs-directory</a></li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-org4efe093" class="outline-2">
<h2 id="org4efe093">GitHub</h2>
<div class="outline-text-2" id="text-org4efe093">
<p>
Any useful commentary in GitHub.
</p>
</div>

<div id="outline-container-org52aab06" class="outline-3">
<h3 id="org52aab06">Mine</h3>
<div class="outline-text-3" id="text-org52aab06">
<p>
Tickets that I raised, or to which I added significant commentary.
</p>
</div>
</div>

<div id="outline-container-org73dfcfa" class="outline-3">
<h3 id="org73dfcfa">C++</h3>
<div class="outline-text-3" id="text-org73dfcfa">
<ul class="org-ul">
<li><a href="https://github.com/jothepro/doxygen-awesome-css/issues/2">doxygen-awesome-css: Creating a link to the dark theme #2</a></li>
<li><a href="https://github.com/doxygen/doxygen/issues/8455">doxygen: Documentation coverage information #8455</a></li>
</ul>
</div>

<div id="outline-container-org04bedc9" class="outline-4">
<h4 id="org04bedc9">Emacs</h4>
<div class="outline-text-4" id="text-org04bedc9">
<ul class="org-ul">
<li><a href="https://github.com/skuro/plantuml-mode/issues/134">plantuml-mode: Vertical split preview #134</a></li>
<li><a href="https://github.com/nobiot/org-transclusion/issues/59">org-transclusion: Transclusion of non-org mode files #59</a></li>
<li><a href="https://github.com/abo-abo/define-word/issues/29">define-word: Redefining display function to output to a buffer instead of messages #29</a></li>
<li><a href="https://github.com/emacs-csharp/csharp-mode/issues/230">beginning-of-defun et al. not behaving the same as on C++ mode #230</a></li>
</ul>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2021-03-23 Tue 21:31</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
